-- imdb

-- Commands:
.schema shows
-- Output:
-- CREATE TABLE shows (
--     id INTEGER,
--     title TEXT NOT NULL,
--     year NUMERIC,
--     episodes INTEGER,
--     PRIMARY KEY(id)
-- );

.tables
-- Output:
-- genres  people  ratings  shows  stars  writers

.schema ratings
-- Output:
-- CREATE TABLE ratings (
--     show_id INTEGER NOT NULL UNIQUE,
--     rating REAL NOT NULL,
--     votes INTEGER NOT NULL,
--     FOREIGN KEY(show_id) REFERENCES shows(id)
-- );


-- Query:
SELECT * FROM shows LIMIT 10;
--Output:
-- ╭─────┬───────────────────────────┬────┬────────╮
-- │ id  │           title           │year│episodes│
-- ╞═════╪═══════════════════════════╪════╪════════╡
-- │62614│Zeg 'ns Aaa                │1981│     227│
-- │63881│Catweazle                  │1970│      26│
-- │63962│UFO                        │1970│      26│
-- │65269│Ace of Wands               │1970│      46│
-- │65270│The Adventures of Don Quick│1970│       6│
-- │65271│Albert and Victoria        │1970│      12│
-- │65272│All My Children            │1970│    9699│
-- │65273│Archie's Funhouse          │1970│      23│
-- │65274│Arnie                      │1970│      48│
-- │65276│Barefoot in the Park       │1970│      12│
-- ╰─────┴───────────────────────────┴────┴────────╯

-- Query:
SELECT COUNT(*) FROM shows;
--Output:
-- ╭──────────╮
-- │ COUNT(*) │
-- ╞══════════╡
-- │   250087 │
-- ╰──────────╯

-- Query:
SELECT COUNT(*) FROM people;
--Output:
-- ╭──────────╮
-- │ COUNT(*) │
-- ╞══════════╡
-- │   704315 │
-- ╰──────────╯

-- Query:
SELECT * FROM ratings LIMIT 10;
--Output:
-- ╭─────────┬────────┬───────╮
-- │ show_id │ rating │ votes │
-- ╞═════════╪════════╪═══════╡
-- │   62614 │    6.7 │   392 │
-- │   63881 │    7.9 │  1224 │
-- │   63962 │    7.9 │  4518 │
-- │   65269 │    7.5 │   141 │
-- │   65270 │    7.5 │    33 │
-- │   65271 │    5.4 │    11 │
-- │   65272 │    6.8 │  3548 │
-- │   65273 │    6.8 │   219 │
-- │   65274 │    7.0 │   149 │
-- │   65276 │    6.6 │    80 │
-- ╰─────────┴────────┴───────╯

-- Relationships:
/*
1. One-to-One:
Where row in one table can map to row in another table
*/

/*
  SQLite DATA TYPES:
  1. BLOB (stands for Binary Large Objects stores raw 0s and 1s used to store files as well as sometimes binary data)
  2. INTEGER
  3. NUMERIC (dates, time types of data)
  4. REAL (like floats)
  5. TEXT
*/

/*
  CONSTRAINTS:
  KEYWORDS WORTH NOTING IN SQL:
  1. NOT NULL
  2. UNIQUE
*/

/*
  PRIMARY KEYS AND FOREIGN KEYS:
  1. Primary Key (PK)
  The Primary Key is a unique ID for every row in a table. It ensures that no two records are exactly the same.

   - Unique: Like a Social Security Number or a Passport ID.

   - Mandatory: Every row must have one, and it cannot be empty (NULL).

   - One per table: A table can only have one primary key.

  2. Foreign Key (FK)
  A Foreign Key is a column that points to a Primary Key in another table. It’s how you link data together.

   - Relationship: It creates a connection (e.g., linking a "Book" to its "Author").

   - Consistency: It prevents "orphan" data; you can't have a book written by an author ID that doesn't exist in the Author table.

   - Multiple: A table can have many foreign keys.
*/

-- Query:
SELECT * FROM ratings WHERE rating >= 6.0 LIMIT 10;
--Output:
-- ╭─────────┬────────┬───────╮
-- │ show_id │ rating │ votes │
-- ╞═════════╪════════╪═══════╡
-- │   62614 │    6.7 │   392 │
-- │   63881 │    7.9 │  1224 │
-- │   63962 │    7.9 │  4518 │
-- │   65269 │    7.5 │   141 │
-- │   65270 │    7.5 │    33 │
-- │   65272 │    6.8 │  3548 │
-- │   65273 │    6.8 │   219 │
-- │   65274 │    7.0 │   149 │
-- │   65276 │    6.6 │    80 │
-- │   65277 │    8.0 │    35 │
-- ╰─────────┴────────┴───────╯

-- Query:
SELECT show_id FROM ratings WHERE rating >= 6.0 LIMIT 10;
--Output:
-- ╭─────────╮
-- │ show_id │
-- ╞═════════╡
-- │   62614 │
-- │   63881 │
-- │   63962 │
-- │   65269 │
-- │   65270 │
-- │   65272 │
-- │   65273 │
-- │   65274 │
-- │   65276 │
-- │   65277 │
-- ╰─────────╯

-- Query:
SELECT * FROM shows WHERE id IN (
  SELECT show_id FROM ratings WHERE rating >= 6.0
) LIMIT 10;
--Output:
-- ╭─────┬───────────────────────────┬────┬────────╮
-- │ id  │           title           │year│episodes│
-- ╞═════╪═══════════════════════════╪════╪════════╡
-- │62614│Zeg 'ns Aaa                │1981│     227│
-- │63881│Catweazle                  │1970│      26│
-- │63962│UFO                        │1970│      26│
-- │65269│Ace of Wands               │1970│      46│
-- │65270│The Adventures of Don Quick│1970│       6│
-- │65272│All My Children            │1970│    9699│
-- │65273│Archie's Funhouse          │1970│      23│
-- │65274│Arnie                      │1970│      48│
-- │65276│Barefoot in the Park       │1970│      12│
-- │65277│The Best of Everything     │1970│     115│
-- ╰─────┴───────────────────────────┴────┴────────╯

-- Query:
SELECT title FROM shows WHERE id IN (
  SELECT show_id FROM ratings WHERE rating >= 6.0
) LIMIT 10;
--Output:
-- ╭─────────────────────────────╮
-- │            title            │
-- ╞═════════════════════════════╡
-- │ Zeg 'ns Aaa                 │
-- │ Catweazle                   │
-- │ UFO                         │
-- │ Ace of Wands                │
-- │ The Adventures of Don Quick │
-- │ All My Children             │
-- │ Archie's Funhouse           │
-- │ Arnie                       │
-- │ Barefoot in the Park        │
-- │ The Best of Everything      │
-- ╰─────────────────────────────╯

-- JOIN
-- Query:
SELECT * FROM shows
JOIN ratings ON shows.id = ratings.show_id
WHERE rating >= 6.0 LIMIT 10;
--Output:
-- ╭─────┬────────┬────┬────────┬───────┬──────┬─────╮
-- │ id  │ title  │year│episodes│show_id│rating│votes│
-- ╞═════╪════════╪════╪════════╪═══════╪══════╪═════╡
-- │62614│Zeg 'ns │1981│     227│  62614│   6.7│  392│
-- │     │Aaa     │    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │63881│Catweazl│1970│      26│  63881│   7.9│ 1224│
-- │     │e       │    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │63962│UFO     │1970│      26│  63962│   7.9│ 4518│
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65269│Ace of  │1970│      46│  65269│   7.5│  141│
-- │     │Wands   │    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65270│The     │1970│       6│  65270│   7.5│   33│
-- │     │Adventur│    │        │       │      │     │
-- │     │es of   │    │        │       │      │     │
-- │     │Don     │    │        │       │      │     │
-- │     │Quick   │    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65272│All My  │1970│    9699│  65272│   6.8│ 3548│
-- │     │Children│    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65273│Archie's│1970│      23│  65273│   6.8│  219│
-- │     │Funhouse│    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65274│Arnie   │1970│      48│  65274│   7.0│  149│
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65276│Barefoot│1970│      12│  65276│   6.6│   80│
-- │     │in the  │    │        │       │      │     │
-- │     │Park    │    │        │       │      │     │
-- ├─────┼────────┼────┼────────┼───────┼──────┼─────┤
-- │65277│The Best│1970│     115│  65277│   8.0│   35│
-- │     │of Every│    │        │       │      │     │
-- │     │thing   │    │        │       │      │     │
-- ╰─────┴────────┴────┴────────┴───────┴──────┴─────╯

-- Query:
SELECT title, rating FROM shows
JOIN ratings ON ratings.show_id = shows.id
WHERE rating >= 6.0 LIMIT 10;
--Output:
-- ╭─────────────────────────────┬────────╮
-- │            title            │ rating │
-- ╞═════════════════════════════╪════════╡
-- │ Zeg 'ns Aaa                 │    6.7 │
-- │ Catweazle                   │    7.9 │
-- │ UFO                         │    7.9 │
-- │ Ace of Wands                │    7.5 │
-- │ The Adventures of Don Quick │    7.5 │
-- │ All My Children             │    6.8 │
-- │ Archie's Funhouse           │    6.8 │
-- │ Arnie                       │    7.0 │
-- │ Barefoot in the Park        │    6.6 │
-- │ The Best of Everything      │    8.0 │
-- ╰─────────────────────────────┴────────╯

-- Command:
.schema genres
-- Output:
-- CREATE TABLE genres (
--     show_id INTEGER NOT NULL,
--     genre TEXT NOT NULL,
--     FOREIGN KEY(show_id) REFERENCES shows(id)
-- );

-- Query:
SELECT * FROM genres LIMIT 10;
--Output:
-- ╭─────────┬───────────╮
-- │ show_id │   genre   │
-- ╞═════════╪═══════════╡
-- │   62614 │ Comedy    │
-- │   63881 │ Adventure │
-- │   63881 │ Comedy    │
-- │   63881 │ Family    │
-- │   63962 │ Action    │
-- │   63962 │ Sci-Fi    │
-- │   65269 │ Family    │
-- │   65269 │ Fantasy   │
-- │   65270 │ Comedy    │
-- │   65270 │ Sci-Fi    │
-- ╰─────────┴───────────╯

-- Query:
SELECT * FROM shows WHERE id = 63881;
--Output:
-- ╭───────┬───────────┬──────┬──────────╮
-- │  id   │   title   │ year │ episodes │
-- ╞═══════╪═══════════╪══════╪══════════╡
-- │ 63881 │ Catweazle │ 1970 │       26 │
-- ╰───────┴───────────┴──────┴──────────╯


/*
  2. One-to-Many:
    When a single record in one table is associated with multiple records in another table.
*/

-- Query:
SELECT genre FROM genres WHERE show_id = 63881;
--Output:
-- ╭───────────╮
-- │   genre   │
-- ╞═══════════╡
-- │ Adventure │
-- │ Comedy    │
-- │ Family    │
-- ╰───────────╯

-- Query:
SELECT genre FROM genres WHERE show_id = (
  SELECT id FROM shows WHERE title = 'Catweazle'
);
--Output:
-- ╭───────────╮
-- │   genre   │
-- ╞═══════════╡
-- │ Adventure │
-- │ Comedy    │
-- │ Family    │
-- ╰───────────╯

-- Query:
SELECT title, genre FROM shows
JOIN genres ON shows.id = genres.show_id
WHERE id = 63881;
--Output:
-- ╭───────────┬───────────╮
-- │   title   │   genre   │
-- ╞═══════════╪═══════════╡
-- │ Catweazle │ Adventure │
-- │ Catweazle │ Comedy    │
-- │ Catweazle │ Family    │
-- ╰───────────┴───────────╯

-- Query:
SELECT title FROM shows
JOIN genres ON shows.id = genres.show_id
WHERE id = 63881;
--Output:
-- +-----------+
-- |   title   |
-- +-----------+
-- | Catweazle |
-- | Catweazle |
-- | Catweazle |
-- +-----------+

-- Query:

--Output:

-- Query:

--Output:

-- Query:

--Output: